# CSCI 4253 / 5253 - Lab #3 - Patent Problem with SQL - SOLUTION
<div>
 <h2> CSCI 4283 / 5253 
  <IMG SRC="https://www.colorado.edu/cs/profiles/express/themes/cuspirit/logo.png" WIDTH=50 ALIGN="right"/> </h2>
</div>

In this assignment, we're going to solve a problem for which you'll also see the solution in Hadoop and then implement a PySpark solution. We have two databases
* One contains information about patents
* One contains information about patent citations (one patent citing the work of another)
The problem we're going to solve is augmenting the original patent data to include the number of *co-state citations*. In other words, if patent X was issued to someone in Colorado and patent Y was also issued to someone in Colorado and X cites Y, then this is a co-state citation.

The easiest way to solve this is to build an intermediary product from the patent citations table. That table contains `CITING` and `CITED` columns; you would augment it by adding `CITING_STATE` and `CITED_STATE`. Then, it becomes fairly simple to filter out all the cases where those states don't match. You can then use an sql `GROUP BY` to `COUNT(*)` all the co-state citations for a given patent and then join that with the original patents table resulting in an augmented table.

The final results for the first 13 words, sorted in descending order by co-state citations looks like the following
![this final output](final-output.png)

The challenge is going to be that I want you do to this *a single SQL query*. We're assuming you've learned some SQL in a previous life and if not, [now is a great time to learn](https://www.sqlitetutorial.net/). Even if you've done basic SQL, you'll probably need to review [using `select` in a where-clause or using multiple joins](https://dba.stackexchange.com/questions/33553/using-select-in-the-where-clause-of-another-select).

## Logistics

We're going to be using the SQLite3 system which runs entirely from a file (no server needed). The `Makefile` contains commands to download the raw data as ZIP files.

We can run shell commands in our notebook using [builtin "magic" commands](https://ipython.readthedocs.io/en/stable/interactive/magics.html). You need to run this at least once prior to starting the lab to make certain you have the files and have created the `patents.sq3` database file. It will take a few minutes to complete & you should see that the `patents.sq3` file is about 645MBytes in size.

In [1]:
%%bash
make
rm patents.sq3
zcat < acite75_99.zip | sqlite3 patents.sq3 ".mode csv" ".import /dev/stdin citations"
zcat < apat63_99.zip | sqlite3 patents.sq3 ".mode csv" ".import /dev/stdin patents"
ls -l patents.sq3

make: Nothing to be done for 'all'.
-rw-r--r-- 1 jovyan users 647274496 Sep 13 22:46 patents.sq3

We'll use another "magic" to run SQL queries in notebook cells. The following will load the SQL extension and connect to the `patents.sq3` file.

In [2]:
%load_ext sql
%sql sqlite:///patents.sq3

'Connected: @patents.sq3'

Following this, we can run individual SQL queries and see the result by putting `%%sql` at the front of a cell. If you don't have that, you'll be running Python code.

So, for example, we can examine our two raw database tables.

In [3]:
%%sql
select * from patents limit 5;

 * sqlite:///patents.sq3
Done.

[('3070801', '1963', '1096', '', 'BE', '', '', '1', '', '269', '6', '69', '', '1', '', '0', '', '', '', '', '', '', ''),
 ('3070802', '1963', '1096', '', 'US', 'TX', '', '1', '', '2', '6', '63', '', '0', '', '', '', '', '', '', '', '', ''),
 ('3070803', '1963', '1096', '', 'US', 'IL', '', '1', '', '2', '6', '63', '', '9', '', '0.3704', '', '', '', '', '', '', ''),
 ('3070804', '1963', '1096', '', 'US', 'OH', '', '1', '', '2', '6', '63', '', '3', '', '0.6667', '', '', '', '', '', '', ''),
 ('3070805', '1963', '1096', '', 'US', 'CA', '', '1', '', '2', '6', '63', '', '1', '', '0', '', '', '', '', '', '', '')]

In [4]:
%%sql
select * from citations limit 5;

 * sqlite:///patents.sq3
Done.

[('3858241', '956203'),
 ('3858241', '1324234'),
 ('3858241', '3398406'),
 ('3858241', '3557384'),
 ('3858241', '3634889')]

If you want to create indexes over various fields, go ahead. It shouldn't affect the correctness of your results but may affect the performance.

## Steps to the full solution

In order to determine when a *cited* patent and a *citing* patent are from the same state,
we're going to need to produce a series of tables that combine information from the citations and the patents tables.

We can use a simple left-outer join (or just **JOIN**) to get the information for one or the other column in the citations table. For example, we can determine the state for *cited* patents using this join:

In [5]:
%%sql
SELECT CITED, patents.POSTATE as CITED_POSTATE, CITING
FROM citations JOIN patents
WHERE CITED == PATENT
limit 5;

 * sqlite:///patents.sq3
Done.

[('3398406', 'FL', '3858241'),
 ('3557384', 'MA', '3858241'),
 ('3634889', 'OH', '3858241'),
 ('3319261', 'OH', '3858242'),
 ('3668705', 'WI', '3858242')]

In [6]:
%%sql
SELECT COUNT(*), CITED, patents.POSTATE as CITED_POSTATE, CITING
FROM citations JOIN patents
WHERE CITED == PATENT
GROUP BY PATENT
limit 5;

 * sqlite:///patents.sq3
Done.

[(1, '3070801', '', '4093112'),
 (9, '3070803', 'IL', '4133055'),
 (3, '3070804', 'OH', '3972325'),
 (1, '3070805', 'CA', '4400830'),
 (3, '3070807', 'OH', '4058119')]

Then, you'll need to do the same for the `CITING` column as well. As mentioned earlier, you may want to review [using `select` in a where-clause or using multiple joins](https://dba.stackexchange.com/questions/33553/using-select-in-the-where-clause-of-another-select).

In [7]:
%%sql
SELECT CITING, patents.POSTATE as CITING_POSTATE, CITED
FROM citations JOIN patents
WHERE CITING == PATENT
limit 5;

 * sqlite:///patents.sq3
Done.

[('3858241', 'MA', '956203'),
 ('3858241', 'MA', '1324234'),
 ('3858241', 'MA', '3398406'),
 ('3858241', 'MA', '3557384'),
 ('3858241', 'MA', '3634889')]

In [8]:
%%sql
SELECT COUNT(*), CITING, patents.POSTATE as CITING_POSTATE, CITED
FROM citations JOIN patents
WHERE CITING == PATENT
GROUP BY PATENT
limit 5;

 * sqlite:///patents.sq3
Done.

[(5, '3858241', 'MA', '956203'),
 (4, '3858242', 'MI', '1515701'),
 (7, '3858243', '', '2949611'),
 (6, '3858244', 'CT', '14040'),
 (7, '3858245', 'NY', '2072303')]

## Your solution

Eneter your solution as a single SQL query below:

In [16]:
%%sql
SELECT *, COUNT(CITED) as CO_CITED_COUNT
FROM (SELECT Citings.*, patents.POSTATE as CITING_STATE
      FROM (SELECT patents.*, CITED, patents.POSTATE as CITED_STATE, CITING
            FROM citations as Citeds
            JOIN patents
            WHERE Citeds.CITED == patents.patent and patents.COUNTRY == 'US') as Citings
      JOIN patents
      WHERE Citings.CITING == patents.patent and patents.COUNTRY == 'US')
WHERE CITED_STATE == CITING_STATE
GROUP BY CITING
ORDER BY CO_CITED_COUNT DESC
LIMIT 5;

 * sqlite:///patents.sq3
Done.

[('4195352', '1980', '7389', '1977', 'US', 'CA', '635240', '2', '4', '708', '2', '22', '11', '21', '1', '0.7029', '0.6281', '11.1905', '3.9091', '0', '0', '0', '0', '4195352', 'CA', '5959466', 'CA', 125),
 ('3572278', '1971', '4099', '1968', 'US', 'TX', '186585', '2', '', '114', '5', '55', '', '7', '', '0.449', '', '18.8571', '', '', '', '0', '0', '3572278', 'TX', '5983822', 'TX', 103),
 ('4739098', '1988', '10336', '1986', 'US', 'CA', '19170', '2', '15', '560', '1', '14', '1', '102', '1', '0.7343', '0', '8.0784', '3', '0', '0', '0.93', '0.9118', '4739098', 'CA', '6008204', 'CA', 100),
 ('4739098', '1988', '10336', '1986', 'US', 'CA', '19170', '2', '15', '560', '1', '14', '1', '102', '1', '0.7343', '0', '8.0784', '3', '0', '0', '0.93', '0.9118', '4739098', 'CA', '5952345', 'CA', 98),
 ('4739098', '1988', '10336', '1986', 'US', 'CA', '19170', '2', '15', '560', '1', '14', '1', '102', '1', '0.7343', '0', '8.0784', '3', '0', '0', '0.93', '0.9118', '4739098', 'CA', '5998655', 'CA', 96)]